Revit 2026 API

# AnalyticalAutomationFailures Properties

---

The BuiltInFailuresAnalyticalAutomationFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmptySelection | There are no selected elements. |

#### Reference

BuiltInFailuresAnalyticalAutomationFailures Class

Autodesk.Revit.DB Namespace